Table of Contents
 Class IdeaBoltGrid
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaBoltGrid : AbstractIdeaObject<IIdeaBoltGrid>, IEquatable<AbstractIdeaObject<IIdeaBoltGrid>>, IIdeaBoltGrid, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaBoltGrid>
IdeaBoltGrid
Implements
IEquatable<AbstractIdeaObject<IIdeaBoltGrid>>
IIdeaBoltGrid
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaBoltGrid>.Id
 AbstractIdeaObject<IIdeaBoltGrid>.Name
 AbstractIdeaObject<IIdeaBoltGrid>.Identifier
 AbstractIdeaObject<IIdeaBoltGrid>.GetHashCode()
 AbstractIdeaObject<IIdeaBoltGrid>.Equals(object)
 AbstractIdeaObject<IIdeaBoltGrid>.Equals(AbstractIdeaObject<IIdeaBoltGrid>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaBoltGrid(Identifier<IIdeaBoltGrid>)
protected IdeaBoltGrid(Identifier<IIdeaBoltGrid> identifer)
Parameters
identifer Identifier<IIdeaBoltGrid>
 IdeaBoltGrid(int)
public IdeaBoltGrid(int id)
Parameters
id int
 IdeaBoltGrid(string)
public IdeaBoltGrid(string id)
Parameters
id string
Properties
 BoltAssembly
Bolt Assembly
public IIdeaBoltAssembly BoltAssembly { get; set; }
Property Value
IIdeaBoltAssembly
 BoltShearType
Defines a transfer of shear force in bolts.
public BoltShearType BoltShearType { get; set; }
Property Value
BoltShearType
 ConnectedParts
Collection of parf witch shoud be bolted
public IEnumerable<IIdeaObjectConnectable> ConnectedParts { get; set; }
Property Value
IEnumerable<IIdeaObjectConnectable>
 LocalCoordinateSystem
Local Coordinate System (LCS) of the bolt grid. Only vector definition of the LCS is supported, so the instance of CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 Origin
Origin node of the bolt grid.
public virtual IIdeaNode Origin { get; set; }
Property Value
IIdeaNode
 Positions
Collection of nodes specific position of the bolt
public IEnumerable<IIdeaNode> Positions { get; set; }
Property Value
IEnumerable<IIdeaNode>
 ShearInThread
Shear in thread
public bool ShearInThread { get; set; }
Property Value
bool
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Edit this page